---
title: CableTrayType
classe: Autodesk.Revit.DB.Electrical.CableTrayType
namespace: Autodesk.Revit.DB.Electrical
eredita: Autodesk.Revit.DB.MEPCurveType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# CableTrayType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double BendMultiplier { get; set; }` | `cableTrayType.BendMultiplier` | Double |
| `Boolean IsWithFitting { get; }` | `cableTrayType.IsWithFitting` | Boolean |
| `CableTrayShape ShapeType { get; }` | `cableTrayType.ShapeType` | CableTrayShape |
| `Boolean IsValidBendMultiplier(Double)` | `cableTrayType.IsValidBendMultiplier(bendMultiplier)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```